# Знакомство с языком Python (семинары)
# Урок 9. Работа с табличными данными
# https://gb.ru/lessons/391160/homework

""""
Для решения данного домашнего задания вам необходимо 
воспользоваться сервисом автоматической проверки написанного кода.
Для того, чтобы успешно выполнить задание, необходимо 
перейти по каждой из представленных ссылок и решить все предложенные задачи. 
Будьте внимательны, количество попыток отправки кода на проверку ограничено! 
Вам дано 5 попыток на каждую задачу.

Прикреплять полученные решения не требуется. 
Итоговая оценка домашнего задания появится автоматически на платформе 
после решения всех задач. Полученная оценка не повлияет на получение 
итогового документа об обучении.


Задача 1
Определить среднюю стоимость дома

Дан файл california_housing_train.csv. Определить среднюю стоимость дома, 
где количество людей от 0 до 500 (population) и сохранить ее в переменную avg. 
Используйте модуль pandas.


# Задача 2
"""