""" 
Знакомство с языком Python (семинары)
Урок 3. Списки и словари """
# https://gb.ru/lessons/391154/homework


""" Задача 1 (16) """
# https://autotest.gb.ru/problems/21?lesson_id=391154&_ga=2.8891701.1648384661.1703691758-1734585693.1703049693

""" 
Требуется вычислить, сколько раз встречается 
некоторое число k в массиве list_1.
Найдите количество и выведите его. 
"""

# # Пример:

# list_1 = [1, 2, 3, 4, 5]
# k = 3
# # 1



""" Задача 2 (18) """
# https://autotest.gb.ru/problems/22?lesson_id=391154&_ga=2.41926050.1648384661.1703691758-1734585693.1703049693

"""
Требуется найти в массиве list_1 
самый близкий по значению элемент к заданному числу k и вывести его.
Считать, что такой элемент может быть только один. 
Если значение k совпадает с этим элементом - выведите его.
"""

# # Пример:

# list_1 = [1, 2, 3, 4, 5]
# k = 6
# # 5