# Знакомство с языком Python (семинары)
# Урок 4. Словари, множества и профилирование
# https://gb.ru/lessons/391155/homework


"""
Задача 1
Возведение в степень

Напишите функцию f, которая на вход принимает два числа a и b, и возводит число a в целую степень b с помощью рекурсии.
Функция не должна ничего выводить, только возвращать значение.

Пример:
"""
# a = 3; b = 5 -> 243 (3⁵)
# a = 2; b = 3 -> 8 


"""
Задача 2
Рекурсивная сумма

Напишите рекурсивную функцию sum(a, b), 
возвращающую сумму двух целых неотрицательных чисел. 
Из всех арифметических операций допускаются только +1 и -1. 
Также нельзя использовать циклы.
Функция не должна ничего выводить, только возвращать значение.

Пример:
"""
# sum(2, 2)
# # 4
